---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.TilePatternTileFailures
source: html/cd65a341-6fc8-965c-9d2a-1fd7d8512733.htm
---
# Autodesk.Revit.DB.BuiltInFailures.TilePatternTileFailures

Failures related to tile pattern tile.

## Syntax (C#)
```csharp
public static class TilePatternTileFailures
```